app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`perishable_token` = '123456789') LIMIT 1
---
  def activate_account
    @user = User.find_by_perishable_token(params[:token])